Revit 2015 API
TessellatedShapeBuilderOutcome Enumeration
 Describes the outcome of TessellatedShapeBuilder attempt to build geometrical objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public enum TessellatedShapeBuilderOutcome
Visual Basic
Public Enumeration TessellatedShapeBuilderOutcome
Visual C++
public enum class TessellatedShapeBuilderOutcome
Members
Member name | Description
SolidOrSheet |  A geometry was created.
Mesh |  A mesh was created
Mixed |  A geometry and a mesh were created
Nothing |  Nothing was built.
See Also
Autodesk.Revit.DB Namespace